Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ViewSheetSetUIService
The UI service which permits registration of an external server for new UI managing ViewSheetSet.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.TemporaryGraphicsHandlerService
The external service Id which permits registration of an callback handler for temporary graphics objects managed by Autodesk::Revit::DB::TemporaryGraphicsManager.
To use this service, developers implement a server class that derives from Autodesk::Revit::UI::ITemporaryGraphicsHandler.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.SnappingService
Autodesk Internal: The service which provides snap points and lines

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.SiteLinkerUIService
The external UI service which permits registration of an alternate servers for new UI of link topography

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.RevisionsOnSheetUIService
The UI service which permits registration of an external server for new UI managing RevisionsOnSheet selection

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.RebarUpdateService
Autodesk Internal: The service for updating rebar freeform elements

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PathOfTravelCalculationService
Autodesk Internal: The service for path of travel calculations

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ModifyConnectionRangesService
The external service to view and modify structural connection ranges of applicability.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ModelAccessValidationService
The external service which validates the access to Revit model such as Revit Cloud model.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.IFCEntityTreeUIService
The UI service which permits registration of an external server for new UI managing IFCEntity Selection

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.HoleDefinitionService
The external service to view and modify hole definition parameters.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.GenericRepoHelperService
Unique service id.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ForgeSchemaService
Autodesk Internal: The service for interacting with the Forge Schema Service.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalUIService
Unique service id.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalResourceService
The external service which permits registration of an alternate servers for managing external resources such as linked files.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalParameterService
Autodesk Internal: The service for shared parameter selection.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalDataTypeService
Unique service id.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ElectricalAnalyticalLoadSetUIService
The UI service which permits registration of an external server for UI managing Electrical Analytical Load Set.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ElectricalAnalyticalLoadCombinationUIService
The UI service which permits registration of an external server for UI managing Electrical Analytical Load Combination.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CustomFieldService
Autodesk Internal: The service for updating the custom fields of a schedule.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CustomFieldEditPropertiesService
Autodesk Internal: The service for editing properties of a custom field.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.AlignmentService
Autodesk Internal: The service for Infrastructure Alignments

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.AXMImporterService
The external service which permits registration of an alternate implementation for AXM import.